; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared2 - mode
	spectrograph0 - mode
	image1 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star17)
	(supports instrument5 spectrograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star17)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star0)
	(supports instrument7 image1)
	(calibration_target instrument7 Star0)
	(supports instrument8 image1)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon12)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(have_image Planet3 infrared2)
	(have_image Phenomenon5 image1)
	(have_image Planet6 image1)
	(have_image Star7 spectrograph0)
	(have_image Star8 image1)
	(have_image Phenomenon9 image1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 image1)
	(have_image Phenomenon12 infrared2)
	(have_image Phenomenon13 image1)
	(have_image Phenomenon14 image1)
	(have_image Planet15 spectrograph0)
	(have_image Phenomenon16 infrared2)
	(have_image Star17 spectrograph0)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 15
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 15
3. (turn_to satellite4 star0 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 star0)
   goals met: 0 of 15
4. (calibrate satellite4 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 0 of 15
5. (turn_to satellite4 phenomenon10 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 15
6. (take_image satellite4 phenomenon10 instrument6 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 1 of 15
7. (turn_to satellite4 phenomenon12 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 15
8. (take_image satellite4 phenomenon12 instrument6 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 2 of 15
9. (turn_to satellite4 phenomenon16 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon16)
   goals met: 2 of 15
10. (take_image satellite4 phenomenon16 instrument6 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 3 of 15
11. (turn_to satellite4 planet15 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 planet15)
   goals met: 3 of 15
12. (take_image satellite4 planet15 instrument6 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 4 of 15
13. (turn_to satellite4 planet3 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet3)
   goals met: 4 of 15
14. (take_image satellite4 planet3 instrument6 infrared2)
   added: (have_image planet3 infrared2)
   goals met: 5 of 15
15. (turn_to satellite4 star17 planet3)
   deleted: (pointing satellite4 planet3)
   added: (pointing satellite4 star17)
   goals met: 5 of 15
16. (take_image satellite4 star17 instrument6 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 6 of 15
17. (turn_to satellite4 star7 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star7)
   goals met: 6 of 15
18. (take_image satellite4 star7 instrument6 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 7 of 15
19. (turn_to satellite1 star0 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star0)
   goals met: 7 of 15
20. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 7 of 15
21. (turn_to satellite1 phenomenon13 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon13)
   goals met: 7 of 15
22. (take_image satellite1 phenomenon13 instrument2 image1)
   added: (have_image phenomenon13 image1)
   goals met: 8 of 15
23. (turn_to satellite1 phenomenon14 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon14)
   goals met: 8 of 15
24. (take_image satellite1 phenomenon14 instrument2 image1)
   added: (have_image phenomenon14 image1)
   goals met: 9 of 15
25. (turn_to satellite1 phenomenon5 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon5)
   goals met: 9 of 15
26. (take_image satellite1 phenomenon5 instrument2 image1)
   added: (have_image phenomenon5 image1)
   goals met: 10 of 15
27. (turn_to satellite1 phenomenon9 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon9)
   goals met: 10 of 15
28. (take_image satellite1 phenomenon9 instrument2 image1)
   added: (have_image phenomenon9 image1)
   goals met: 11 of 15
29. (turn_to satellite1 planet11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet11)
   goals met: 11 of 15
30. (take_image satellite1 planet11 instrument2 image1)
   added: (have_image planet11 image1)
   goals met: 12 of 15
31. (turn_to satellite1 planet6 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet6)
   goals met: 12 of 15
32. (take_image satellite1 planet6 instrument2 image1)
   added: (have_image planet6 image1)
   goals met: 13 of 15
33. (turn_to satellite1 star8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star8)
   goals met: 13 of 15
34. (take_image satellite1 star8 instrument2 image1)
   added: (have_image star8 image1)
   goals met: 14 of 15
35. (turn_to satellite0 groundstation2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation2)
   goals met: 15 of 15
